Autodesk.Revit.DB.Architecture.RoomTagTypeSet
A set that contains room tag types.

Autodesk.Revit.DB.Architecture.RoomTagTypeSet.Insert(Autodesk.Revit.DB.Architecture.RoomTagType)
System.Int32
Insert the specified room tag type into the set.
item: The room tag type to be inserted into the set.
Returns: Returns whether the room tag type was inserted into the set.

Autodesk.Revit.DB.Architecture.RoomTagTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Architecture.RoomTagTypeSet.ReverseIterator
Autodesk.Revit.DB.Architecture.RoomTagTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Architecture.RoomTagTypeSet.ForwardIterator
Autodesk.Revit.DB.Architecture.RoomTagTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Architecture.RoomTagTypeSet.Erase(Autodesk.Revit.DB.Architecture.RoomTagType)
System.Int32
Removes a specified room tag type from the set.
item: The room tag type to be erased.
Returns: The number of room tag types that were erased from the set.

Autodesk.Revit.DB.Architecture.RoomTagTypeSet.Contains(Autodesk.Revit.DB.Architecture.RoomTagType)
System.Boolean
Tests for the existence of a room tag type within the set.
item: The room tag type to be searched for.
Returns: The Contains method returns True if the room tag type is within the set, otherwise False.

Autodesk.Revit.DB.Architecture.RoomTagTypeSet.Clear
void
Removes every room tag type from the set, rendering it empty.

Autodesk.Revit.DB.Architecture.RoomTagTypeSet.Size
System.Int32
get
Returns the number of room tag types that are in the set.

Autodesk.Revit.DB.Architecture.RoomTagTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.